//Задание 7. Пользователь вводит две границы диапазона, вывести на экран все числа из этого диапазона.
//Предусмотреть, чтобы пользователь мог вводить границы диапазона в произвольном порядке.
//

#include <iostream>
using namespace std;
int main()
{
    

    setlocale(LC_ALL, "RUS");


    float a, b, summa;
    summa = 0;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << "\t   Для вычисления суммы всех чисел диапазона введите Его границы\n";
    cout << "\t\t_________________________________________________\n\n";
    cout << "\t\t\tВведите границу 1 диапазона:  ";
    cin >> a;
    cout << endl;
    cout << "\t\t\tВведите границу 2 диапазона:  ";
    cin >> b;
    //--------------------------------------------------------------------
    cout << endl;
    cout << endl;
    cout << endl;
    if (a > b) {
        cout << endl;
        cout << endl;
        cout << "\t==================================================================\n\n";
        cout << "\t\t\t\tОшибка ввода!!!\n";
        cout << "\t    Начальное число диапазона должно быть меньше конечного\n\n";
        cout << "\t==================================================================\n\n";
    }
    
       
        if (a < b) {
            cout << "\t------------------------------------------------------------------\n\n";
            cout << "\t\tПрограмма посчитала сумму всех чисел диапазона\n\n";
            cout << "\t\t\t\tот" << "  " << a << "  " << "до" << "  " << b;
            cout << endl;
            cout << endl;
            cout << "\t------------------------------------------------------------------\n\n";
            for (int i = a; i <= b; i++) {
                summa = summa + a;
                a++;
                
            }
            cout << "\t\t   Сумма всех чисел диапазона равна:  " << summa;
        }
        
    
        

    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;
    cout << endl;





    return 0;
}

