// Задание 1. Напишите программу, которая вычисляет сумму целых чисел от а до 500
//(значение a вводится с клавиатуры).


#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian"); //включили русский язык в консоли

	int a;
	int b = 500;
	int summa ;
	int max_i;
	

	cout << endl;
	cout << endl;

	cout << "\t\t Данная программа вычисляет сумму чисел в определенном Вами диапазоне.\n\n";
	cout << "\t\t Начальным числом диапазона будет число, которое Вы введете с клавиатуры.\n";
	cout << "\t\t Конечным числом является число 500.\n";
	cout << endl;
	cout << "\t\t ___________________________________________________________________________\n\n";


	cout << endl;
	cout << endl;
	cout << endl;
	cout << "\t\t Введите начальное целое число диапазона: ";
	cin >> a;
	cout << endl;
	cout << "\t\t" << " " << "Считаем сумму чисел от" << " " << a << " " << "до" << " " << "500\n\n ";
	cout << "\t ----------------------------------------------------------------------------------\t";
	cout << endl;
	
	
	
	max_i = b - a;
	summa = a;
	cout << "\t\t Первая сумма = " << summa;
	cout << endl;
	cout << "\t --------------------------------------------------\t";
	cout << endl;

	for (int i=0 ; i < max_i; i++) { //рассматривается диапазон чисел от "а" до 500 включительно;
		a++;
		summa = summa + a;
		
		cout << "\t\t" << " " << "Следующее прибавляемое число : " << " " << a << ";   "<<" "<<" | "<<" "<< "Сумма =" << " " << (summa - a) << " " << " + " << " " << a << " " << " = " << " " << summa;
		cout << endl;
	}
	
	cout << "\t ----------------------------------------------------------------------------------\t";
	cout << endl;
	cout << endl;
	cout << "\t\t Суммма всех целых чисел в определенном Вами диапазоне равна:\t" << summa;
	cout << endl;
	cout << endl;
	cout << endl;
	cout << endl;
	cout << endl;
	cout << endl;
	cout << endl;
	cout << endl;
	return 0;
}


